# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. 
# Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод 
# — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

from random import randint

n = int(input("Введите количество кустов: "))
a = int(input("Максимальное количество ягод на кусте: "))

nums = [randint(1, a) for num in range(n)]
print("Количество ягод по кустам: ", nums)
print()
nums_count = list()
     
for i in range(len(nums)-1):
    nums_count.append(nums[i - 1] + nums[i] + nums[i + 1])
nums_count.append(nums[-2] + nums[-1] + nums[0])

print(f"Максимальное количество ягод {max(nums_count)}")